fluidSim/pimpleFoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    domainWalls
    {
        type            noSlip;
    }

    NASAsc2-0410
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

}
